Revit 2024 API
CurtainGridSetIterator Class
An iterator to a set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public abstract class CurtainGridSetIterator : APIObject,
	IEnumerator
Visual Basic
Public MustInherit Class CurtainGridSetIterator _
	Inherits APIObject _
	Implements IEnumerator
Visual C++
public ref class CurtainGridSetIterator abstract : public APIObject,
	IEnumerator
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.CurtainGridSetIterator
See Also
CurtainGridSetIterator Members
Autodesk.Revit.DB Namespace